app/views/static_pages/beer_list.html.erb

SELECT DISTINCT "breweries"."nationality" FROM "breweries"
---
			<p>Filtrera på land</p>
			<% countries = Brewery.select(:nationality).distinct.map {|country| [country.nationality, country.nationality] } %>