app/views/static_pages/brewery_list.html.erb

			<p>Filtrera på land</p>
			<% countries = Brewery.select(:nationality).distinct.map {|country| [country.nationality, country.nationality] } %>
---
SELECT DISTINCT "breweries"."nationality" FROM "breweries"

			</div>
			<div class="col beer-count"><%= brewery.beers.count %></div>
---
SELECT COUNT(*) FROM "beers"  WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]