app/views/brewery_contacts/_form.html.erb

			<%= f_bc.label :contact_type_id, "Kontakttyp" %>
			<%= collection_select(:brewery_contact, :contact_type_id, ContactType.all ,:id, :name) %>
---
SELECT "brewery_contacts".* FROM "brewery_contacts"  WHERE "brewery_contacts"."brewery_id" = ?  [["brewery_id", 3]]
SELECT "contact_types".* FROM "contact_types"