app/views/beer_types/index.html.erb

SELECT "beers".* FROM "beers"  WHERE "beers"."beer_type_id" = ?  [["beer_type_id", 1]]
---
			<div class="col name"><%= bt.name %></div>
			<div class="col count"><%= bt.beers.length %></div>