app/views/breweries/show.html.erb

SELECT "brewery_contacts".* FROM "brewery_contacts"  WHERE "brewery_contacts"."brewery_id" = ?  [["brewery_id", 1]]
---
	<p>Kontaktinfo</p>
	<% @brewery.brewery_contacts.all.each do |bc| %>

SELECT "contact_types".* FROM "contact_types"
---
			<%= f_bc.label :contact_type_id %>
			<%= collection_select(:brewery_contact, :contact_type_id, ContactType.all ,:id, :name) %>