app/views/breweries/show.html.erb

	<div id="brewery-beer-list">
	<% @brewery.beers.each do |b| %>
---
SELECT "beers".* FROM "beers"  WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]