app/views/beers/_form.html.erb

SELECT "breweries".* FROM "breweries"
---
			<div class="form-label"><%= f.label :brewery_id %></div>
			<div class="form-input"><%= collection_select(:beer, :brewery_id, Brewery.all ,:id, :name) %></div>

SELECT "beer_types".* FROM "beer_types"
---
			<div class="form-label"><%= f.label :beer_type_id %></div>
			<div class="form-input"><%= collection_select(:beer, :beer_type_id, BeerType.all ,:id, :name) %></div>