app/controllers/beer_types_controller.rb

	def index
		@beer_types = BeerType.all
---
SELECT "beer_types".* FROM "beer_types"

	def create
		@beer_type = BeerType.new(beer_type_params)

		if @beer_type.save
---
INSERT INTO "beer_types" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-05-05 19:12:21.567369"], ["name", "Ale"], ["updated_at", "2014-05-05 19:12:21.567369"]]

	def edit
		@beer_type = BeerType.find(params[:id])
---
SELECT  "beer_types".* FROM "beer_types"  WHERE "beer_types"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@beer_type = BeerType.find(params[:id])

		if @beer_type.update(beer_type_params)
---
SELECT  "beer_types".* FROM "beer_types"  WHERE "beer_types"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "beer_types" SET "name" = ?, "updated_at" = ? WHERE "beer_types"."id" = 1  [["name", "Ale23"], ["updated_at", "2014-05-05 21:28:24.897285"]]

	def destroy
		@beer_type = BeerType.find(params[:id])
		@beer_type.destroy
---
SELECT  "beer_types".* FROM "beer_types"  WHERE "beer_types"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "beer_types" WHERE "beer_types"."id" = ?  [["id", 6]]