app/controllers/beers_controller.rb

	def index
		@beers = Beer.all
---
SELECT "beers".* FROM "beers"

	def show
		@beer = Beer.find(params[:id])
---
SELECT  "beers".* FROM "beers"  WHERE "beers"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@beer = Beer.new(beer_params)

		if @beer.save
---
INSERT INTO "beers" ("abv", "beer_type_id", "brewery_id", "created_at", "ebc", "ibu", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["abv", 10.0], ["beer_type_id", 2], ["brewery_id", 1], ["created_at", "2014-05-13 17:18:10.303098"], ["ebc", 30], ["ibu", 20], ["name", "Öl-två"], ["updated_at", "2014-05-13 17:18:10.303098"]]

	def edit
		@beer = Beer.find(params[:id])
---
SELECT  "beers".* FROM "beers"  WHERE "beers"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@beer = Beer.find(params[:id])

		if @beer.update(beer_params)
---
SELECT  "beers".* FROM "beers"  WHERE "beers"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "beers" SET "systembolaget" = ?, "updated_at" = ? WHERE "beers"."id" = 1  [["systembolaget", 123123], ["updated_at", "2014-05-24 21:32:40.250792"]]

	def destroy
		@beer = Beer.find(params[:id])
		@beer.destroy
---
SELECT  "beers".* FROM "beers"  WHERE "beers"."id" = ? LIMIT 1  [["id", 7]]
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 7]]