app/controllers/brewery_contacts_controller.rb

	def create
		@brewery = Brewery.find(params[:brewery_id])
		@brewery_contact = @brewery.brewery_contacts.create(brewery_contact_params)
---
SELECT  "breweries".* FROM "breweries"  WHERE "breweries"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "brewery_contacts" ("brewery_contact", "brewery_id", "contact_type_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["brewery_contact", "1234"], ["brewery_id", 1], ["contact_type_id", 2], ["created_at", "2014-05-09 23:38:07.965820"], ["updated_at", "2014-05-09 23:38:07.965820"]]

	def destroy
		@brewery = Brewery.find(params[:brewery_id])
		@brewery_contact = @brewery.brewery_contacts.find(params[:id])
		@brewery_contact.destroy
---
SELECT  "breweries".* FROM "breweries"  WHERE "breweries"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "brewery_contacts".* FROM "brewery_contacts"  WHERE "brewery_contacts"."brewery_id" = ? AND "brewery_contacts"."id" = ? LIMIT 1  [["brewery_id", 1], ["id", 5]]
DELETE FROM "brewery_contacts" WHERE "brewery_contacts"."id" = ?  [["id", 5]]