app/controllers/breweries_controller.rb

	def index
		@breweries = Brewery.all
---
SELECT "breweries".* FROM "breweries"

	def show
		@brewery = Brewery.find(params[:id])
---
SELECT  "breweries".* FROM "breweries"  WHERE "breweries"."id" = ? LIMIT 1  [["id", 1]]

	def create
		@brewery = Brewery.new(brewery_params)

		if @brewery.save
---
INSERT INTO "breweries" ("created_at", "name", "nationality", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-05-08 16:57:14.173373"], ["name", "Tester"], ["nationality", "UK"], ["updated_at", "2014-05-08 16:57:14.173373"]]

	def edit
		@brewery = Brewery.find(params[:id])
---
SELECT  "breweries".* FROM "breweries"  WHERE "breweries"."id" = ? LIMIT 1  [["id", 1]]

	def update
		@brewery = Brewery.find(params[:id])

		if @brewery.update(brewery_params)
---
SELECT  "breweries".* FROM "breweries"  WHERE "breweries"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "breweries" SET "img_content_type" = ?, "img_file_name" = ?, "img_file_size" = ?, "img_updated_at" = ?, "updated_at" = ? WHERE "breweries"."id" = 6  [["img_content_type", "image/jpeg"], ["img_file_name", "Desert.jpg"], ["img_file_size", 845941], ["img_updated_at", "2014-05-25 15:14:13.610529"], ["updated_at", "2014-05-25 15:14:14.166561"]]

	def destroy
		@brewery = Brewery.find(params[:id])
		@brewery.destroy
---
SELECT  "breweries".* FROM "breweries"  WHERE "breweries"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "breweries" WHERE "breweries"."id" = ?  [["id", 2]]