app/controllers/contact_types_controller.rb

	def index
		@contact_types = ContactType.all
---
SELECT "contact_types".* FROM "contact_types"

	def create
		@contact_type = ContactType.new(contact_types_params)

		if @contact_type.save
---
INSERT INTO "contact_types" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2014-05-01 23:05:22.640547"], ["name", ""], ["updated_at", "2014-05-01 23:05:22.640547"]]

	def edit
		@contact_type = ContactType.find(params[:id])
---
SELECT  "contact_types".* FROM "contact_types"  WHERE "contact_types"."id" = ? LIMIT 1  [["id", 2]]

	def update
		@contact_type = ContactType.find(params[:id])

		if @contact_type.update(contact_types_params)
---
SELECT  "contact_types".* FROM "contact_types"  WHERE "contact_types"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "contact_types" SET "name" = ?, "updated_at" = ? WHERE "contact_types"."id" = 3  [["name", "tel"], ["updated_at", "2014-05-05 18:21:20.585291"]]

	def destroy
		@contact_type = ContactType.find(params[:id])
		@contact_type.destroy
---
SELECT  "contact_types".* FROM "contact_types"  WHERE "contact_types"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "contact_types" WHERE "contact_types"."id" = ?  [["id", 1]]