app/controllers/static_pages_controller.rb

SELECT  "beers".* FROM "beers"   ORDER BY "beers"."created_at" DESC LIMIT 5
---
	def start
		@new_beers = Beer.order(created_at: :desc).limit(5)

SELECT "beers".* FROM "beers"   ORDER BY "beers"."name" ASC
SELECT "beers".* FROM "beers"
---
	def beer_list

		@beers = Beer.all.order(name: :asc)
		@beers = @beers.search(params[:search]) if !params[:search].blank?

SELECT "breweries".* FROM "breweries"  WHERE (name LIKE '%ca%' OR city LIKE '%ca%' OR nationality LIKE '%ca%' OR state LIKE '%ca%')
SELECT "breweries".* FROM "breweries"  WHERE (nationality = '%Norge%')
---
	def brewery_list

		@breweries = Brewery.all.order(name: :asc)
		@breweries = @breweries.search(params[:search]) if !params[:search].blank?