app/controllers/users_controller.rb

SELECT "users".* FROM "users"   ORDER BY "users"."admin" DESC
---
	def index
		@users = User.order(admin: :desc)

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create
		@user = User.new(user_params)
		if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 7  [["password_digest", "$2a$10$iD0KdlpAATjLsm4ZGCPF0uxIiiMpWuidZImcDw4GRNQKZm.Q.G7bC"], ["updated_at", "2014-05-24 19:06:05.141741"]]
---
	def update
		@user = User.find(params[:id])

		if @user.update(user_params)

SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "users" SET "admin" = ?, "updated_at" = ? WHERE "users"."id" = 6  [["admin", "t"], ["updated_at", "2014-05-22 22:06:00.025169"]]
---
	def toggle_admin
		user = User.find(params[:id])
		user.toggle!(:admin)